//Page构造函数，参数类型为Object
Page({
//=========【数据区】(类比Vue实例中的data)==========
  data: {

    
  },
//=========【方法定义区】(类比Vue实例中的methods)==========




//=========【生命周期区】(类比Vue实例中的生命周期钩子)==========
  /**
   * 生命周期函数--页面加载时执行
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--页面初次渲染完成时执行
   */
  onReady() {

  },

  /**
   * 生命周期函数--页面显示时执行
   */
  onShow() {

  },

  /**
   * 生命周期函数--页面隐藏时执行
   */
  onHide() {

  },

  /**
   * 生命周期函数--页面卸载时执行
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--用户下拉动作时执行
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})